In [1]:
import pandas as pd

In [2]:
pd.read_excel(r'C:\Users\HP\Desktop\dataset1.xlsx')

     name  roll.no  marks   address
0  sindhu        6     98   nellore
1  harika        7     69    kavali
2   pinky        8     85  tirupati
3   honey        9     76    ongole

In [3]:
pd.read_csv(r'C:\Users\HP\Desktop\dataset2.csv')

     name  roll.no  marks   address
0  sindhu        6   98.0   nellore
1  harika        7   69.0    kavali
2   pinky        8   85.0  tirupati
3   honey        9   76.0    ongole
4     anu       10   99.5   nellore
5    suji       11   88.0     kovur

In [13]:
pd.read_csv(r'C:\Users\HP\Desktop\dataset3.tsv',sep='\t')

    name  class  no  attendance
0    tej      8  20          98
1  bhanu      2   8          64
2  sindh      4   6          88